In [1]:
import numpy as np
import pandas as pd

In [2]:
new_data = {
    'Movie': ['Star-Wars', 'Star-Wars','Batman','Batman', 'Deadpool','Deadpool'],
    'Viewers':['Me','MF','MOF', 'Bobby', 'Dean','Sammy'],
    'Ratings':[10,7,6,9,8,5]
}

In [7]:
movies = pd.DataFrame(new_data)
movies

       Movie Viewers  Ratings
0  Star-Wars      Me       10
1  Star-Wars      MF        7
2     Batman     MOF        6
3     Batman   Bobby        9
4   Deadpool    Dean        8
5   Deadpool   Sammy        5

In [9]:
# Groupby Movie and find mean.
movies.groupby('Movie').mean()

           Ratings
Movie
Batman         7.5
Deadpool       6.5
Star-Wars      8.5

In [ ]:
# Group